In [132]:
import pandas as pd
import numpy as np
import random
from io import StringIO,BytesIO

In [133]:
 data = pd.read_csv(r'C:\PANDA_FILES\EMPLOYEE_DATA_PANDA.csv', usecols=['first_name'	,'last_name',	'salary',	'age',
                                                                       'monthlybonus','annualbasicpay',
                                                                       'annualbonus','tax','deduction',
                                                                       'annualfinalpay','netpay','discount'])

In [134]:
data

,first_name,last_name,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,annualfinalpay,netpay,discount
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0

In [135]:
value = int(data['salary'].sum() - data.loc[200:400, 'salary'].sum())
value

53923408

In [136]:
# Data cleaning and Transformation ...
# df.rename()
# df.drop()
# df.astype()
# df.apply()
# df.applymapp
# df.map()
# df.replace()
# df.clip()
# df.sort_values()
# df.sort_index()

In [137]:
# 1 ....df.rename Function : data.rename(mapper=None,index=None,Columns=None,axis=None,copy=True,inplace=True,errors='ignore')
data.rename(columns={'first_name': 'name'}, inplace=True)
data.rename(columns={'last_name':'surname'},inplace =True)
data.rename(columns={'annualfinalpay':'finalpayment'},inplace = True)
data

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0

In [138]:
#2.... df.drop Function : It is used to remove the rows and columns .
# data.drop(labels=None,axis=0,index=None,columns=None,level=None,inplace=False,errors='raise')
data.drop(columns='discount',errors='raise')

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79
...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51

In [139]:
#3..... data.astype() : This function is used to change the data type.
# data[''].astype(dtype,copy=True,errors='raise')
data['netpay'].astype(int,errors='raise')

0      846466
1      399720
2      466361
3      481339
4      506950
        ...
995    624471
996    863681
997    700662
998    574590
999    852716
Name: netpay, Length: 1000, dtype: int64

In [140]:
#4.... data.apply() : It is used to apply the function to each rows and column...

# Applying function to each columns ..
data['salary'].apply(lambda x: x).sum()
data['netpay'].apply(lambda x:x*x).sum()

np.float64(745235885541808.2)

In [141]:
# Applying functions to each columns ....
data.loc[101,['salary']].apply(lambda row : row).sum()

np.float64(38281.78)

In [142]:
diff = data.loc[208:215, ['netpay']].sum()- data.loc[202:207, ['netpay']].sum() 
diff.item()
diff

netpay    1178256.97
dtype: float64

In [143]:
data.loc[[202]].apply(lambda row: row['netpay'] - row['salary'], axis=1).sum()

np.float64(625133.44)

In [144]:
# Apply on specific column ....
data.loc[1:100,['salary']].apply(lambda x:x*2)
data.describe()

,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount
count,1000.00000,1000.000000,1000.00000,1.000000e+03,1000.000000,1000.00000,1000.000000,1.000000e+03,1.000000e+03,586.0
mean,65086.86393,40.978000,6511.23904,7.813486e+05,78134.868480,4.20800,33131.820820,7.482168e+05,8.263517e+05,7.0
std,19941.24807,11.398923,1992.51686,2.391020e+05,23910.202315,1.83633,17359.186501,2.259982e+05,2.498825e+05,0.0
min,30102.76000,22.000000,3010.28000,3.612331e+05,36123.360000,2.00000,10002.020000,3.359468e+05,3.720702e+05,7.0
25%,47979.75000,31.000000,4800.81250,5.760977e+05,57609.750000,2.00000,14248.062500,5.645757e+05,6.221855e+05,7.0
50%,64537.40500,41.000000,6458.56500,7.750277e+05,77502.780000,5.00000,33074.970000,7.595271e+05,8.370299e+05,7.0
75%,82785.63000,51.000000,8278.56250,9.934276e+05,99342.750000,5.00000,49671.380000,9.437562e+05,1.043099e+06,7.0
max,99969.69000,60.000000,9996.97000,1.199636e+06,119963.640000,7.00000,59981.810000,1.139654e+06,1.259618e+06,7.0

In [145]:
# 5 . data.applymap() : change or transform evvery single  value in data frame ...
data.applymap(lambda x : x*2)

C:\Users\Ayush\AppData\Local\Temp\ipykernel_20564\917437307.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  data.applymap(lambda x : x*2)

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount
0,JoshuaJoshua,RamosRamos,79584.80,84,13062.76,1567531.20,156753.12,4,31350.62,1536180.58,1692933.70,14.0
1,DavidDavid,KingKing,64679.74,78,6467.98,776156.88,77615.76,14,54330.98,721825.90,799441.66,14.0
2,MichaelMichael,CarlsonCarlson,75463.06,72,7546.30,905556.72,90555.60,14,63388.98,842167.74,932723.34,14.0
3,ChristyChristy,MartinMartin,77886.60,56,7788.66,934639.20,93463.92,14,65424.74,869214.46,962678.38,14.0
4,KathleenKathleen,McintyreMcintyre,82030.88,92,8203.08,984370.56,98436.96,14,68905.94,915464.62,1013901.58,14.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,AustinAustin,NicholsNichols,96369.12,44,9636.92,1156429.44,115643.04,4,23128.58,1133300.86,1248943.90,14.0
996,RaymondRaymond,RobertsRoberts,133284.26,120,13328.42,1599411.12,159941.04,4,31988.22,1567422.90,1727363.94,14.0
997,NancyNancy,KelleyKelley,108126.98,52,10812.70,1297523.76,129752.40,4,25950.48,1271573.28,1401325.68,14.0
998,AlyssaAlyssa,RiveraRivera,88671.40,92,8867.14,1064056.80,106405.68,4,21281.14,1042775.66,1149181.34,14.0
999,WalterWalter,VillanuevaVillanueva,131592.06,82,13159.20,1579104.72,157910.40,4,31582.10,1547522.62,1705433.02,14.0

In [146]:
data.loc[100:200,'salary'].sum()

np.float64(4419807.0200000005)

In [147]:
# data.map() : works only on single columns not on whole data frame ...
data['bonus']= data['salary'].map(lambda x : x*2)
data

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount,bonus
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0,79584.80
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0,64679.74
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0,75463.06
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0,77886.60
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0,82030.88
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0,96369.12
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0,133284.26
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0,108126.98
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0,88671.40
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0,131592.06

In [148]:
# data.replace() : IT is used to replace the specific value inside the data frame....
# data.replace(to_replace = None,inplace = True,value = None, limit = None ,regex = True,method = None )
data.replace (to_replace = 'salary',value='netpay')

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount,bonus
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0,79584.80
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0,64679.74
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0,75463.06
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0,77886.60
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0,82030.88
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0,96369.12
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0,133284.26
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0,108126.98
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0,88671.40
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0,131592.06

In [149]:
# data.clip() : It is use to limit the value inside the data frame or series  within the maximum  and 
# minimum threshold ....
# data.clip(lower=None,upper=None,axis=None,inplace=False)
data.loc[101:200,['salary']].clip()

data

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount,bonus
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0,79584.80
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0,64679.74
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0,75463.06
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0,77886.60
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0,82030.88
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0,96369.12
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0,133284.26
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0,108126.98
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0,88671.40
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0,131592.06

In [150]:
data.loc[0].info()

<class 'pandas.core.series.Series'>
Index: 13 entries, name to bonus
Series name: 0
Non-Null Count  Dtype
--------------  -----
13 non-null     object
dtypes: object(1)
memory usage: 764.0+ bytes

In [151]:
data.drop(columns = 'bonus',errors='raise')

,name,surname,salary,age,monthlybonus,annualbasicpay,annualbonus,tax,deduction,finalpayment,netpay,discount
0,Joshua,Ramos,39792.40,42,6531.38,783765.60,78376.56,2,15675.31,768090.29,846466.85,7.0
1,David,King,32339.87,39,3233.99,388078.44,38807.88,7,27165.49,360912.95,399720.83,7.0
2,Michael,Carlson,37731.53,36,3773.15,452778.36,45277.80,7,31694.49,421083.87,466361.67,7.0
3,Christy,Martin,38943.30,28,3894.33,467319.60,46731.96,7,32712.37,434607.23,481339.19,7.0
4,Kathleen,Mcintyre,41015.44,46,4101.54,492185.28,49218.48,7,34452.97,457732.31,506950.79,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,Austin,Nichols,48184.56,22,4818.46,578214.72,57821.52,2,11564.29,566650.43,624471.95,7.0
996,Raymond,Roberts,66642.13,60,6664.21,799705.56,79970.52,2,15994.11,783711.45,863681.97,7.0
997,Nancy,Kelley,54063.49,26,5406.35,648761.88,64876.20,2,12975.24,635786.64,700662.84,7.0
998,Alyssa,Rivera,44335.70,46,4433.57,532028.40,53202.84,2,10640.57,521387.83,574590.67,7.0
999,Walter,Villanueva,65796.03,41,6579.60,789552.36,78955.20,2,15791.05,773761.31,852716.51,7.0

In [152]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            1000 non-null   object
 1   surname         1000 non-null   object
 2   salary          1000 non-null   float64
 3   age             1000 non-null   int64
 4   monthlybonus    1000 non-null   float64
 5   annualbasicpay  1000 non-null   float64
 6   annualbonus     1000 non-null   float64
 7   tax             1000 non-null   int64
 8   deduction       1000 non-null   float64
 9   finalpayment    1000 non-null   float64
 10  netpay          1000 non-null   float64
 11  discount        586 non-null    float64
 12  bonus           1000 non-null   float64
dtypes: float64(9), int64(2), object(2)
memory usage: 101.7+ KB

In [156]:
data['salary'].sort_values().sum()

np.float64(65086863.92999999)

In [157]:
data['salary'].sort_index()

0      39792.40
1      32339.87
2      37731.53
3      38943.30
4      41015.44
         ...
995    48184.56
996    66642.13
997    54063.49
998    44335.70
999    65796.03
Name: salary, Length: 1000, dtype: float64